Tekla.Structures.Model.RebarSet
The RebarSet class represents a set of reinforcing bars.
The following example shows how to create a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create rebarset
var rebarSet = new RebarSet();
rebarSet.RebarProperties.Name = "RebarSet Test";
rebarSet.RebarProperties.Grade = "The Grade";
rebarSet.RebarProperties.BendingRadius = 42.0;
rebarSet.RebarProperties.Class = 7;
rebarSet.RebarProperties.Size = "16";
rebarSet.LayerOrderNumber = 17;
// Create leg face 1
var legFace1 = new RebarLegFace
{
LayerOrderNumber = 2,
AdditonalOffset = 25.0,
Reversed = false
};
legFace1.Contour.AddContourPoint(new ContourPoint(new Point(0, 0, 0), null));
legFace1.Contour.AddContourPoint(new ContourPoint(new Point(800, 0, 0), null));
legFace1.Contour.AddContourPoint(new ContourPoint(new Point(800, 1200, 0), null));
legFace1.Contour.AddContourPoint(new ContourPoint(new Point(0, 1200, 0), null));
// Add leg face 1
rebarSet.LegFaces.Add(legFace1);
// Create leg face 2
var legFace2 = new RebarLegFace
{
LayerOrderNumber = 2,
AdditonalOffset = 25.0,
Reversed = false
};
legFace2.Contour.AddContourPoint(new ContourPoint(new Point(0, 0, 0), null));
legFace2.Contour.AddContourPoint(new ContourPoint(new Point(0, 0, 500), null));
legFace2.Contour.AddContourPoint(new ContourPoint(new Point(0, 1200, 500), null));
legFace2.Contour.AddContourPoint(new ContourPoint(new Point(0, 1200, 0), null));
//  Add leg face 2
rebarSet.LegFaces.Add(legFace2);
// Create the guideline
var guideline = new RebarGuideline();
result.Spacing.Zones.Add(new RebarSpacingZone
{
Spacing = 200, SpacingType = RebarSpacingZone.SpacingEnum.EXACT,
Length = 1000, LengthType = RebarSpacingZone.LengthEnum.RELATIVE,
NumberOfSpaces = 10,
NumberOfSpacesType = RebarSpacingZone.SpacingEnum.TARGET
});
guideline.Curve.AddContourPoint(new ContourPoint(new Point(0.0, 0.0, 0.0), null));
guideline.Curve.AddContourPoint(new ContourPoint(new Point(0.0, 1200, 0.0), null));
rebarSet.Guidelines.Add(guideline);
rebarSet.Insert();
}
}

Tekla.Structures.Model.RebarSet.CreateInstance
The create instance.
Returns:
The System.Boolean.

Tekla.Structures.Model.RebarSet.ModifyInstance
The modify instance.
Returns:
The System.Boolean.

Tekla.Structures.Model.RebarSet.SelectInstance
The select instance.
Returns:
The System.Boolean.

Tekla.Structures.Model.RebarSet.ToStruct(Tekla.Structures.ModelInternal.dotRebarSet_t@)
The to struct.
p:
The p.

Tekla.Structures.Model.RebarSet.FromStruct(Tekla.Structures.ModelInternal.dotRebarSet_t@)
The from struct.
p:
The p.